{
  "projects": [
    {
      "image": "images/projects/chefswap-icon.png",
      "title": "Chefswap - Social Cooking Meetup App",
      "bodyText": "- A Marketplace-style social web app made to connect users over homecooked meals.\n- Implemented REST design principles to develop flexible and scalable RESTful API backend using Express\n- Applied relational database expertise to design and interface with PostgreSQL database for storing, accessing, and manipulating data securely and efficiently.\n- Documented API using Swagger enabling straightforward integration with frontend",
      "links": [
        {
          "text": "GitHub",
          "href": "https://github.com/MatthewSnelgrove/chefswap"
        }
      ],
      "tags": ["React", "Node", "Express", "PostgreSQL", "JS"]
    },
    {
      "image": "images/projects/plantpedia-icon.jpg",
      "title": "PlantPedia - AI-powered Plant Identification App",
      "bodyText": "- A mobile app that uses AI to identify plants and provide information about them.\n- Model built with TensorFlow has over 90% accuracy in identifying plants from images",
      "links": [
        {
          "text": "GitHub",
          "href": "https://github.com/MatthewSnelgrove/Plantpedia"
        }
      ],
      "tags": ["Python", "Kivy", "TensorFlow", "Machine Learning"]
    },
    {
      "image": "images/projects/smsassist-icon.png",
      "title": "SMS Assist - SMS chatbot for customer service",
      "bodyText": "- An SMS chatbot that uses AI to provide customer service.\n- Used IBM Watson Assistant to classify intent from user input and choose appropriate response\n- Send and receive messages using Twilio API for easy and convenient customer support access via SMS",
      "links": [
        {
          "text": "GitHub",
          "href": "https://github.com/deetsadi/SMS-HelpDesk"
        }
      ],
      "tags": [
        "Node",
        "Twilio",
        "IBM Watson",
        "Natural Language Processing",
        "Chatbot"
      ]
    },
    {
      "image": "images/projects/alexamd-icon.png",
      "title": "Alexa MD - Amazon Alexa skill for medical diagnosis and treatment suggestions",
      "bodyText": "- An Amazon Alexa skill that uses AI to diagnose medical conditions and provide treatment suggestions.\n- Designed decision tree using Voiceflow to ask and track user symptoms and provide appropriate treatment suggestions for predicted illness\n- Compiled data from CDC and WHO to quantitatively associate symptoms with illnesses for use in prediction algorithm\n- Assign probabilities to each illness based on each symptom's association with that illness",
      "links": [
        {
          "text": "Voiceflow Prototype",
          "href": "https://creator.voiceflow.com/prototype/5df30bcb3084ff20c24b0a63"
        },
        {
          "text": "Medical Data",
          "href": "https://docs.google.com/spreadsheets/d/1SScwNAYiOTVJXG90zYkKfwaVVPIaSQZRx77SC4s80Z4"
        }
      ],
      "tags": [
        "Voiceflow",
        "Amazon Alexa",
        "Chatbot",
        "Natural Language Processing"
      ]
    }
  ]
}
